{"chinese_source": "当地震袭击中国时，援助的是中国。", "english_target_correct": "When the earthquake hit China, China was aided.", "english_target_wrong": "When the earthquake hit China,  China has assisted."}
{"chinese_source": "当地震袭击日本时，援助的是中国。", "english_target_correct": "When the earthquake hit Japan, China has assisted.", "english_target_wrong": "When the earthquake hit Japan, China was aided."}
{"chinese_source": "反对的是政府，这个腐败的政府不支持群众集会。", "english_target_correct": "The objection is from the government. This corrupt government does not support mass gatherings.", "english_target_wrong": "The objection is from the government. This corrupt government does not support mass gatherings."}
{"chinese_source": "反对的是政府，群众要求这个腐败的政府改革。", "english_target_correct": "The objection is against the government, and the masses demand this corrupt government to reform.", "english_target_wrong": "The opposition is the government, and the masses demand this corrupt government to reform."}
{"chinese_source": "捕猎的是老虎，老虎的数量正在急剧减少。", "english_target_correct": "Tigers are hunted, so the number of tigers is drastically decreasing.", "english_target_wrong": "Tigers are hunting, so the number of tigers is drastically decreasing."}
{"chinese_source": "捕猎的是老虎，它追赶羚羊的速度很快。", "english_target_correct": "Tigers are hunting, and they run very fast when they chase after the antelope.", "english_target_wrong": "Tigers are hunted, and they run very fast when they chase after the antelope."}
{"chinese_source": "命令的是师级军官，师级军官被要求今早开会。", "english_target_correct": "The commander is a division-level officer, and the officers above the division level are required to attend a meeting this morning.", "english_target_wrong": "The division-level officer was commanded, and the officers above the division level are required to attend a meeting  this morning."}
{"chinese_source": "命令的是师级军官，师所辖旅被要求立即集合。", "english_target_correct": "The division-level officer was commanded, and the division’s jurisdiction is required to gather immediately.", "english_target_wrong": "The commander is a division-level officer, and the division’s jurisdiction is required to gather immediately."}
{"chinese_source": "担心的是妻子，丈夫已经很久没有音信了。", "english_target_correct": "The wife is worried, because the husband has not heard from for a long time.", "english_target_wrong": "Worried about the wife,because the husband has not heard from for a long time"}
{"chinese_source": "担心的是妻子，在我离开之后不知道她能不能肩负起整个家庭。", "english_target_correct": "What I am worried about I is my wife, because  I don’t know if she can shoulder the whole family after my leave.", "english_target_wrong": "The wife is worried, What I am worried about I is my wife, because  I don’t know if she can shoulder the whole family after my leave."}
{"chinese_source": "关心的是她母亲，她母亲熬了粥给生病的她。", "english_target_correct": "Her mother cared for her,  and her mother cooked porridge to her when she was sick.", "english_target_wrong": "Who was concerned about  is her mother,  her mother cooked porridge to her when she was sick."}
{"chinese_source": "关心的是她母亲，她母亲生病了需要照顾。", "english_target_correct": "Who was concerned about is her mother, because sh is sick and requires looking after.", "english_target_wrong": "Her mother cared , her mother is sick and equires looking after."}
{"chinese_source": "反对的是王老师，王老师不支持这个教学计划。", "english_target_correct": "The objection is  from Mr. Wang, and Teacher Wang does not support this teaching plan.", "english_target_wrong": "Against Mr. Wang, Teacher Wang does not support this teaching plan."}
{"chinese_source": "反对的是王老师，其他人认为王老师的提议是不恰当的。", "english_target_correct": "Against Mr. Wang. Others think that Mr. Wang’s proposal is not appropriate.", "english_target_wrong": "The objection is Mr. Wang. Others think that Mr. Wang’s proposal is not appropriate."}
{"chinese_source": "连小孩都不相信,这件事情太假了。", "english_target_correct": "Even children don't believe it, for this thing is too fake.", "english_target_wrong": "He even do not believe in children, for this thing is too fake."}
{"chinese_source": "连小孩都不相信,因为他是个多疑的人。", "english_target_correct": "He even do not believe in children, because he is a righteous person.", "english_target_wrong": "Even the child does not believe because he is a suspicious person."}
{"chinese_source": "鸡不吃了，因为这只鸡已经吃了太多了。", "english_target_correct": "The chicken did not eat because the chicken had already eaten too much.", "english_target_wrong": "Don't eat chicken because the chicken had already eaten too much."}
{"chinese_source": "鸡不吃了，因为最近都在吃鸡，吃腻了。", "english_target_correct": "Don't eat chicken, because we have been having chicken recently and are tired of it.", "english_target_wrong": "The Chicken don't eat, because we have been having chicken recently and are tired of it."}
{"chinese_source": "小杨没找到，已经一个下午没见到小杨了。", "english_target_correct": "He did not find Xiao Yang, and he hadn't seen Xiao Yang in this whole  afternoon.", "english_target_wrong": "Xiao Yang didn't find it,and he hadn't seen Xiao Yang in this whole afternoon."}
{"chinese_source": "小杨没找到，小杨感到很诅丧。", "english_target_correct": "Xiao Yang did not find it, and he felt very sad.", "english_target_wrong": "Did not find Xiao Yang, He felt very sad."}
{"chinese_source": "当刘和珍被杀时，批评的是鲁迅的文章。", "english_target_correct": "When Liu Hezhen was killed, Lu Xun’s articles were criticized.", "english_target_wrong": "When Liu Hezhen was killed, he criticized Lu Xun’s article."}
{"chinese_source": "这个人大放厥词，批评的是鲁迅的文章。", "english_target_correct": "This person was arrogant and criticized Lu Xun's articles.", "english_target_wrong": "This person was arrogant and Lu Xun's article criticized."}
{"chinese_source": "调查的是学生，因为这些学生是这个事件的目击者。", "english_target_correct": "The students were investigated because they were the witnesses to the incident.", "english_target_wrong": "The students are investigating because they were the witnesses to the incident."}
{"chinese_source": "调查的是学生，因为这些学生要完成老师布置的作业。", "english_target_correct": "The students are investigating because they have to complete the assignments assigned by the teacher.", "english_target_wrong": "The students are investigating because they have to complete the assignments assigned by the teacher."}
{"chinese_source": "照顾孩子的妈妈，这个女人在孩子生病时时刻守在孩子身边。", "english_target_correct": "The mother is taking care of the child, and this woman always accompanies the child when he is sick.", "english_target_wrong": "Take care of the child's mother,and  this woman always accompanies child when he is sick."}
{"chinese_source": "照顾孩子的妈妈，她在生完小孩后需要得到精心照顾。", "english_target_correct": "Take care of the child's mother, for she needs to be taken care of after giving birth.", "english_target_wrong": "The mother  is taking care of the child, for she needs to be taken care of after giving birth."}
{"chinese_source": "尊重学生的老师，这是每个学生家长应该要做到的。", "english_target_correct": "Respecting the student's teacher is what every student's parents should do.", "english_target_wrong": "This teacher who respects the students is what every student's parents should do."}
{"chinese_source": "尊重学生的老师，他总是采纳学生的建议。", "english_target_correct": "This teacher who respects the students always adopts the student's advice.", "english_target_wrong": "Respect the student's teacher, he always adopts the student's advice."}
{"chinese_source": "关心企业的员工，这些员工经常从企业的大局出发去工作。", "english_target_correct": "These employees who care about the business often work for the overall situation of the company.", "english_target_wrong": "For concerning about the employees of the company, these employees often work for the overall situation of the company."}
{"chinese_source": "关心企业的员工，老板需要提升他们的生活住宿待遇。", "english_target_correct": "For concerning about the employees of the company, the boss needs to improve their living and accommodation condition.", "english_target_wrong": "These employees care about the business, and the boss needs to improve their living and accommodation condition."}
{"chinese_source": "发现了敌人的哨兵，这个哨兵需要立即汇报敌情。", "english_target_correct": "The sentinel found the enemy, and the sentinel needed to report the enemy immediately.", "english_target_wrong": "The enemy's sentinel was discovered, and the sentinel needed to report the enemy immediately."}
{"chinese_source": "发现了敌人的哨兵，不能让敌人的哨兵逃走。", "english_target_correct": "The enemy's sentinel was discovered and the enemy's sentinel could not be allowed to escape.", "english_target_wrong": "The sentinel found the enemy and the enemy's sentinel could not be allowed to escape."}
{"chinese_source": "喜欢上海的姑娘，因为那的姑娘都很追求时尚。", "english_target_correct": "I like the girls in Shanghai, because the girls  there are very fashionable.", "english_target_wrong": "The girl likes Shanghai, because the girls  there are very fashionable."}
{"chinese_source": "喜欢上海的姑娘，因为上海是一个繁华的城市。", "english_target_correct": "The girl likes Shanghai because Shanghai is a bustling city.", "english_target_wrong": "I like Shanghai girl because Shanghai is a bustling city."}
{"chinese_source": "牵连了局长的女秘书，因为女秘书的违法导致局长被问责。", "english_target_correct": "This female secretary has implicated the director because the female secretary’s violation of the law led to the director being held accountable.", "english_target_wrong": "The director’s female secretary was implicated because the female secretary’s violation of the law ed to the director being held accountable."}
{"chinese_source": "牵连了局长的女秘书，因为局长的违法导致女秘书被问责。", "english_target_correct": "The female secretary of the director was implicated because the director’s violation led to the female secretary being held accountable.", "english_target_wrong": "This female secretary has implicated the director because the director’s violation led to the female secretary being held accountable."}
{"chinese_source": "快接近期末考试了，需要复习一个学期的功课。", "english_target_correct": "It is close to the final exam, you need to review a semester's homework.", "english_target_wrong": "It is close to the final exam, you need to take a semester to review homework."}
{"chinese_source": "这个学期不讲新知识，需要复习一个学期的功课。", "english_target_correct": "The teacher does not teach new knowledge in this semester and needs to take a semester to review homework.", "english_target_wrong": "The teacher does not teach new knowledge in this semester and needs to review a semester's homework."}
{"chinese_source": "讨厌母亲的女儿，这个母亲的儿子不喜欢妹妹。", "english_target_correct": "Hate the mother's daughter,  the mother's son does not like his sister.", "english_target_wrong": "This daughter hates her mother, the mother's son does not like his sister."}
{"chinese_source": "讨厌母亲的女儿，这个母亲的女儿跟母亲关系不好。", "english_target_correct": "This daughter hates her mother, and the mother's daughter has a bad relationship with her mother.", "english_target_wrong": "Hate the mother's daughter, the mother's daughter has a bad relationship with her mother."}
{"chinese_source": "撞倒弟弟的自行车，弟弟对他自行车被撞倒这件事情很生气。", "english_target_correct": "Knocked down my brother's bicycle, and my brother was angry at the fact that his bicycle was knocked down.", "english_target_wrong": "The bicycle knoked dowm my brother,and my brother was angry at the fact that his bicycle was knocked down."}
{"chinese_source": "撞倒弟弟的自行车，幸亏弟弟没有受伤。", "english_target_correct": "The bicycle knoked dowm my brother, Fortunately, my brother was not injured.", "english_target_wrong": "Knocked down my brother's bicycle,Fortunately, my brother was not injured."}
{"chinese_source": "因为要出行很多天，他们准备了一天的干粮。", "english_target_correct": "Because they had to travel for many days,they are preparing dry food all day.", "english_target_wrong": "Because they had to travel for many days, they prepared a dry food for a day."}
{"chinese_source": "因为只要出行一天，他们准备了一天的干粮。", "english_target_correct": "Because  they only need to  travel for one day, they just prepared a dry food for a day.", "english_target_wrong": "Because theyonly need to  travel for one day,they are preparing dry food all day."}
{"chinese_source": "研究鲁迅的文章一般都会写鲁迅的出生和逝世。", "english_target_correct": "These articles which study Lu Xun generally writes Lu Xun's birth and death.", "english_target_wrong": "Studying Lu Xun's article generally writes Lu Xun's birth and death."}
{"chinese_source": "研究鲁迅的文章对于近代文学研究是必须要做的。", "english_target_correct": "Studying Lu Xun's article must be done for modern literature research.", "english_target_wrong": "These articles which study Lu Xun must be done for modern literature research."}
{"chinese_source": "击败敌人的部队，这个部队在回国后受到了人民的欢迎。", "english_target_correct": "The troops defeat the enemy,which were welcomed by the people after returning home.", "english_target_wrong": "Defeat the enemy's troops,which were welcomed by the people after returning home."}
{"chinese_source": "击败敌人的部队，还需要进一步追击。", "english_target_correct": "Defeat the enemy's troops and still need to pursue further.", "english_target_wrong": "The troops defeat the enemy and still need to pursue further."}
{"chinese_source": "骂孩子的父亲，因为孩子考试没考好。", "english_target_correct": "The father criticized the child, because the child's exam did not test well.", "english_target_wrong": "Criticize the child's father, because the child's exam did not test well."}
{"chinese_source": "骂孩子的父亲，因为这个父亲背叛了婚姻。", "english_target_correct": "Criticize the child's father because the father betrayed the marriage.", "english_target_wrong": "The father criticized the child because the father betrayed the marriage."}
{"chinese_source": "请把研究资料拿给我看看。", "english_target_correct": "Please show me the research materials.", "english_target_wrong": "Pleaser show me the reasearch of data."}
{"chinese_source": "研究资料是每个科研人员必做的事情。", "english_target_correct": "The research of data is a thing that every researcher must do.", "english_target_wrong": "Research materialsis a thing that every researcher must do."}
{"chinese_source": "进口食品在售价上比较高。", "english_target_correct": "Imported food is relatively high in price.", "english_target_wrong": "Importing food is relatively high in price."}
{"chinese_source": "进口食品被这个国家的政策不允许。", "english_target_correct": "Importing food is not allowed by the policies of this country.", "english_target_wrong": "Imported food is not allowed by the policies of this country."}
{"chinese_source": "调查材料要在截止日期前上交。", "english_target_correct": "The survey's materials should be submitted before the deadline.", "english_target_wrong": "Surveying materials should be submitted before the deadline."}
{"chinese_source": "调查材料有时需要多人一起合作。", "english_target_correct": "The investigation materials sometimes require multiple people to work together.", "english_target_wrong": "The investigation materials sometimes require multiple people to work together."}
{"chinese_source": "她是去年生的小孩，现在她已经快1岁了。", "english_target_correct": "She was a child born last year, and now she is almost one year old.", "english_target_wrong": "She gave birth to a child last year, and now she is almost one year old."}
{"chinese_source": "她是去年生的小孩，她的小孩已经快1岁了。", "english_target_correct": "She gave birth to a child last year,and her child is almost one year old.", "english_target_wrong": "She was a child born last year, and her child is almost one year old."}
{"chinese_source": "出租汽车被网约车服务压榨了生存环境。", "english_target_correct": "The living environment of taxi is squeezed by the ride-hailing service.", "english_target_wrong": "The living environment of renting car is squeezed by the ride-hailing service."}
{"chinese_source": "出租汽车正在成长为一个新的大市场。", "english_target_correct": "Renting car is growing into a new big market.", "english_target_wrong": "Taxi is growing into a new big market."}
{"chinese_source": "他在校内打球时受伤了，请马上送去学校医院。", "english_target_correct": "He was injured while playing in the school, please send hime to the school's hospital immediately.", "english_target_wrong": "He was injured while playing in the school, please send him to the school and hospital immediately."}
{"chinese_source": "学校医院是人最多的两个公共场合。", "english_target_correct": "School and hospital are the two public places with the most people.", "english_target_wrong": "School's hospital are the two public places with the most people."}
{"chinese_source": "文学语言是两个联系密切的文科专业。", "english_target_correct": "literature and language is two closely related liberal arts majors.", "english_target_wrong": "Literary language is two closely related liberal arts majors."}
{"chinese_source": "文学语言是指在文学作品中使用的语言。", "english_target_correct": "Literary language refers to the language used in literary works.", "english_target_wrong": "literature and language refers to the language used in literary works."}
{"chinese_source": "生物历史，一个偏理科，一个偏文科。", "english_target_correct": "Biology and history, a partial science, a partial liberal arts.", "english_target_wrong": "Biological history, a partial science, a partial liberal arts."}
{"chinese_source": "生物历史指的是生物学的历史。", "english_target_correct": "Biological history refers to the history of biology.", "english_target_wrong": "Biology and history refers to the history of biology."}
{"chinese_source": "其他国家的事等下一次国家会议再讨论。", "english_target_correct": "Other national things will be discussed at the next national meeting.", "english_target_wrong": "Things from other countries will be discussed at the next national meeting."}
{"chinese_source": "其他国家的事等下一次国际会议再讨论。", "english_target_correct": "Things from other countries will be discussed at the next international conference.", "english_target_wrong": "Other national things will be discussed at the next international conference."}
{"chinese_source": "古代战争小说指的是有关古代战争的小说。", "english_target_correct": "The novels of ancient warfare refer to novels about ancient wars.", "english_target_wrong": "Ancient war novels refer to novels about ancient wars."}
{"chinese_source": "古代战争小说指的是古代写的战争小说。", "english_target_correct": "Ancient war novels refer to war novels written in ancient times.", "english_target_wrong": "The novol of ancient warfare refer to war novels written in ancient times."}
{"chinese_source": "非洲语言研究指的是专门研究非洲语言。", "english_target_correct": "The studies of african langugae refer to specializing in studying the africa language.", "english_target_wrong": "African language studies refer to specializing in  studying language in Africa."}
{"chinese_source": "非洲语言研究是在非洲建立的一个语言研究所。 ", "english_target_correct": "African Language Studies is an institute for language studies in Africa.", "english_target_wrong": "African Language Studies is an institute for Africa language studies."}
{"chinese_source": "新教工宿舍是为新的教工专门提供的宿舍。", "english_target_correct": "The dormitory of new faculty is a dormitory dedicated to new faculty.", "english_target_wrong": "The new faculty dormitory is a dormitory dedicated to new faculty."}
{"chinese_source": "新教工宿舍是学校新建的一栋教工宿舍。", "english_target_correct": "The new faculty dormitory is a newly built faculty dormitory.", "english_target_wrong": "The dormitory of new faculty is a newly built faculty dormitory."}
{"chinese_source": "他这辆车已经买了5年了，他想要买一个新汽车牌照。", "english_target_correct": "He has bought this car for five years and he wants to buy a new car license.", "english_target_wrong": "He has bought this car for five years and he wants to buy a license of new car."}
{"chinese_source": "他这辆车是新买的，他想要买一个新汽车牌照。", "english_target_correct": "His car is new and he wants to buy a license of new car.", "english_target_wrong": "His car is new and he wants to buy a new car license."}
{"chinese_source": "大学英语教师指的是教授大学英语的教师。", "english_target_correct": "College English teachers refer to teachers who teach College English.", "english_target_wrong": "The English teachers of college refer to teachers who teach college English."}
{"chinese_source": "大学英语教师指的是在大学教授英语的教师。", "english_target_correct": "The English teachers of college refer to teachers who teach English at the university.", "english_target_wrong": "College English teachers refer to teachers who teach College English at the university."}
{"chinese_source": "两个学校的领导一前一后在同一个开学典礼上说了话。", "english_target_correct": "Two leaders of the school spoke at the same opening ceremony one by one.", "english_target_wrong": "The leaders of the two schools spoke at the same opening ceremony one by one."}
{"chinese_source": "两个学校的领导签署了各自的学校之间互相合作的协议。", "english_target_correct": "The leaders of the two schools signed an agreement to cooperate with each other school.", "english_target_wrong": "Two leaders of the school signed an agreement to cooperate with each other school."}
{"chinese_source": "公园里有三个幼儿园的孩子，总共有6个孩子在做游戏。", "english_target_correct": "There are children of three kindergartens  in the park, and a total of six children are playing games.", "english_target_wrong": "There are three kindergarten children in the park, and a total of six children are playing games."}
{"chinese_source": "公园里有三个幼儿园的孩子，他们在同一个班级。", "english_target_correct": "There are three kindergarten children in the park, they are in the same class.", "english_target_wrong": "There are children of three kindergartens in the park, they are in the same class."}
{"chinese_source": "办公室里有两个党的议员，他们互相攻击对方党派的观点。", "english_target_correct": "There are members of two parties  in the office who attack each other's party views.", "english_target_wrong": "There are two members of the party in the office who attack each other's party views."}
{"chinese_source": "办公室里有两个党的议员，他们在竞选党主席。", "english_target_correct": "There are two members of the party in the office who are running for the party chairman.", "english_target_wrong": "There are members of two parties in the office who are running for the party chairman."}
{"chinese_source": "三个工厂的工人在一起喝酒，一人一瓶总共点了3瓶酒。", "english_target_correct": "The three workers in the factory drank together and ordered a total of 3 bottles of wine in one bottle per person.", "english_target_wrong": "The workers in the three factories drank together and ordered a total of 3 bottles of wine in one bottle per person."}
{"chinese_source": "三个工厂的工人在一起喝酒，一人一瓶总共点了10瓶酒。", "english_target_correct": "The workers in the three factories drank together and ordered a total of 10 bottles of wine in one bottle per person.", "english_target_wrong": "The three workers in the factory drank together and ordered a total of 10 bottles of wine in one bottle per person."}
{"chinese_source": "这栋大楼里有5个医院的医生，他们在讨论医院中各自科室的合作。", "english_target_correct": "There are five doctors  of the hospital in the building who are discussing the cooperation of their respective departments in the hospital.", "english_target_wrong": "There are doctors from five hospitals in the building who are discussing the cooperation of their respective departments in the hospital."}
{"chinese_source": "这栋大楼里有5个医院的医生，他们在讨论各自医院里的合作。", "english_target_correct": "There are doctors from five hospitals in the building who are discussing the cooperation in their respective hospitals.", "english_target_wrong": "There are five doctors of the hospital in the building who are discussing the cooperation in their respective hospitals."}
{"chinese_source": "两个球队的队员从小就是相互认识的好朋友。", "english_target_correct": "The two players of the team are good friends who know each other from an early age.", "english_target_wrong": "The players of the two teams are good friends who know each other from an early age."}
{"chinese_source": "两个球队的队员在体育馆为观众上演了一场精彩的比赛。", "english_target_correct": "The players of the two teams played a wonderful game for the audience in the stadium.", "english_target_wrong": "The two players of the team played a wonderful game for the audience in the stadium."}
{"chinese_source": "在饭店门口的几个饭店的服务员，因为想拉客人去各自的饭店争吵了起来。", "english_target_correct": "The waiters from several restaurants  were arguing because they wanted to pull guests to their respective restaurants in front of the restauran.", "english_target_wrong": "Several waiters at the restaurant  in front of the hotel were arguing because they wanted to pull guests to their respective restaurants."}
{"chinese_source": "在饭店门口的几个饭店的服务员，因为没有客人，所以在闲聊。", "english_target_correct": "Several waiters of the restaurant were chatting because there were no guests in front of the restaurant.", "english_target_wrong": "The waiters at several restaurants in front of the hotel were chatting because there were no guests."}
{"chinese_source": "椅子上摆着两个朋友送的花瓶，这个花瓶是他的两个朋友集资买的。", "english_target_correct": "On the chair was a vase sent by two friends, and this vase was bought by two of his friends.", "english_target_wrong": "On the chair were two vases sent by friends, and this vase was bought by two of his friends."}
{"chinese_source": "椅子上摆着两个朋友送的花瓶，这些花瓶是他的三个朋友集资买的。", "english_target_correct": "On the chair were two vases sent by friends, which were bought by three of his friends.", "english_target_wrong": "On the chair were vases sent by two friends, which were bought by three of his friends."}
{"chinese_source": "对他的帮助，大家都对他表示了感谢。", "english_target_correct": "Everyone thanks him for his help, .", "english_target_wrong": "Everyone thanks him for the help for him,."}
{"chinese_source": "对他的帮助，他用实际行动回报了大家。", "english_target_correct": "For the help for him, he repaied everyone with practical actions.", "english_target_wrong": "For his help, he repaied everyone with practical actions."}
{"chinese_source": "他看了3个宠物店的猫，最后决定了中间一家宠物店购买猫。", "english_target_correct": "He looked at the cats in three pet stores and finally decided to buy cats in the middle pet shop.", "english_target_wrong": "He looked at three cats in the pet store and finally decided to buy cats in the middle pet shop."}
{"chinese_source": "他看了3个宠物店的猫，最后决定了中间那只最可爱的猫。", "english_target_correct": "He looked at three cats in the pet store and finally decided the cutest cat in the middle.", "english_target_wrong": "He looked at the cats in the three pet stores and finally decided the cutest cat in the middle."}
{"chinese_source": "2个城市的警察就在打击犯罪上签署了跨城市合作协议。", "english_target_correct": "The police in two cities signed an inter-city cooperation agreement on combating crime.", "english_target_wrong": "Two Police in the city signed an inter-city cooperation agreement on combating crime."}
{"chinese_source": "2个城市的警察正在街上进行巡逻。", "english_target_correct": "Two Police in the city are patrolling the streets.", "english_target_wrong": "Police in two cities are patrolling the streets."}
{"chinese_source": "小明受到了极大的鼓舞，鼓励的是老师。", "english_target_correct": "Xiao Ming was greatly encouraged and it was the teacher who encouraged him.", "english_target_wrong": "Xiao Ming was greatly encouraged and encouraged the teacher."}
{"chinese_source": "给老师们发放补贴，鼓励的是老师。", "english_target_correct": "Granting subsidies to teachers to encourages teachers.", "english_target_wrong": "Granting subsidies to teachers was encouraged by the teachers."}
{"chinese_source": "由于老师上课认真，嘉奖的是老师们。", "english_target_correct": "Because the teacher gave lesson carefully, the teachers were awarded.", "english_target_wrong": "Because the teacher is serious in class, the teachers award them."}
{"chinese_source": "对于上课认真的同学，嘉奖的是老师们。", "english_target_correct": "For the classmates who are serious in class, the teachers award them.", "english_target_wrong": "For the classmates who are serious in class, the teachers are awarded."}
{"chinese_source": "手术开刀的是他父亲，因为他父亲是医生。", "english_target_correct": "It was his father who operated the surgery because his father was a doctor.", "english_target_wrong": "It was his father who underwentsurgery because his father was a doctor."}
{"chinese_source": "手术开刀的是他父亲，因为他父亲得了重病。", "english_target_correct": "It was his father who underwent surgery, because his father was seriously ill.", "english_target_wrong": "It was his father who operated the surgery, because his father was seriously ill."}
{"chinese_source": "这是我拍于去年的照片，当时我的摄影技巧很不错。", "english_target_correct": "This is a photo I took last year, when my photography skills were very good.", "english_target_wrong": "This is a photo of me last year, when my photography skills were very good."}
{"chinese_source": "这是我拍于去年的照片，是一张不错的自拍。", "english_target_correct": "This is a photo of me last year and it is a good selfie.", "english_target_wrong": "This is a photo I took last year and it is a good selfie."}
{"chinese_source": "调查的是省里的官员，这事惊动了中央。", "english_target_correct": "The focus of this investigation was the provincial officials, which startled the central government.", "english_target_wrong": "The investigation was carried out by provincial officials, which startled the central government."}
{"chinese_source": "调查的是省里的官员，他们对各市的情况很不满意。", "english_target_correct": "The investigation was carried out by provincial officials who were very dissatisfied with the state in each city.", "english_target_wrong": "The investigation was carried on provincial officials who were very dissatisfied with the state  in each city."}
{"chinese_source": "表演的是周杰伦，他唱了一首成名歌曲。", "english_target_correct": "The performer was given by Jay Chou, and he sang a famous song.", "english_target_wrong": "The performance was imitating Jay Chou, and he sang a famous song."}
{"chinese_source": "表演的是周杰伦，这位模仿高手很擅长模仿知名歌手。", "english_target_correct": "The performance was imitating Jay Chou, and the adept imitator is very good at imitating famous singers.", "english_target_wrong": "The performer was given by Jay Chou, and the adept imitator is very good at imitating famous singers."}
{"chinese_source": "补贴的是高科技公司，这是政府的政策。", "english_target_correct": "The subsidy is provided to high-tech companies, which is the government's policy.", "english_target_wrong": "Subsidies are provided by high-tech companies, which is the government's policy."}
{"chinese_source": "补贴的是高科技公司，用户可以收益很多。", "english_target_correct": "Subsidies are provided by high-tech companies, and users can make a lot of money.", "english_target_wrong": "The subsidy is provided to high-tech companies, and users can make a lot of money."}
{"chinese_source": "抗议的是伊拉克政府，人民对其十分不满。", "english_target_correct": "The protest was against the Iraqi government, and the people were very dissatisfied with it.", "english_target_wrong": "The Iraqi government was protesting, and the people were very dissatisfied with it."}
{"chinese_source": "抗议的是伊拉克政府，他们对美国表示强烈谴责。", "english_target_correct": "The Iraqi government was protesting, and strongly condemned the United States.", "english_target_wrong": "The protest was against the Iraqi government, and strongly condemned the United States."}
{"chinese_source": "打击的是美军部队，白宫对此十分愤怒。", "english_target_correct": "The attack was aganist US troops, and the White House was very angry about it.", "english_target_wrong": "The US military was attacking, and the White House was very angry about it."}
{"chinese_source": "打击的是美军部队，他们对地面目标进行了空袭。", "english_target_correct": "The US military was attacking and they carried out air strikes on ground targets.", "english_target_wrong": "The attack was aganist US troops, and they carried out air strikes on ground targets."}
{"chinese_source": "送别的是王老师，同学们都十分难过。", "english_target_correct": "The farewell is to Mr. Wang, and the students were very sad.", "english_target_wrong": "It was Mr. Wang who saw them off, and the students were very sad."}
{"chinese_source": "送别的是王老师，他祝同学们一路顺风。", "english_target_correct": "It was Mr. Wang who saw them off, and he wished the students a good trip.", "english_target_wrong": "The farewell is to Mr. Wang, who wished the students a good trip."}
{"chinese_source": "围剿土匪的部队，随时都可以集结。", "english_target_correct": "The troops that siege the bandits can gather at any time.", "english_target_wrong": "Sieging the troops' bandits can gather at any time."}
{"chinese_source": "围剿土匪的部队，需要正规军出动。", "english_target_correct": "Sieging the troops' bandits need the regular army.", "english_target_wrong": "The troops that siege the bandits need the regular army."}
{"chinese_source": "热爱学校的老师，时刻奋斗在教学第一线。", "english_target_correct": "Teachers who love the school always struggle to be at the forefront of teaching.", "english_target_wrong": "I love the teachers in the school , always struggle to be at the forefront of teaching."}
{"chinese_source": "热爱学校的老师，热爱他们的勤劳付出。", "english_target_correct": "I love the teachers in the school and love their hard work.", "english_target_wrong": "Teachers who love the school  love their hard work."}
{"chinese_source": "思念家乡的人们，无时无刻想回去。", "english_target_correct": "People who miss their hometown  want to go back all the time.", "english_target_wrong": "Missing hometown's people doesn’t want to go back all the time."}
{"chinese_source": "思念家乡的人们，是每个游子会有的心情。", "english_target_correct": "Missing their hometown  is the mood that every wanderer has.", "english_target_wrong": "People who miss their hometown are the mood of every wanderer."}
{"chinese_source": "打倒反对派的人士，欢聚在一起庆祝。", "english_target_correct": "Those people who defeated the opposition gathered together to celebrate.", "english_target_wrong": "Defeat  the opposition, gathered together to celebrate."}
{"chinese_source": "打倒反对派的人士，我相信正义必胜。", "english_target_correct": "Defeat the opposition, I believe that justice will win.", "english_target_wrong": "Those who defeated the opposition, I believe that justice will win."}
{"chinese_source": "发现敌人的部队，我军立刻展开了攻击。", "english_target_correct": "When we found the enemy's troops, our army immediately launched an attack.", "english_target_wrong": "The troops who found enemy , our army immediately launched an attack."}
{"chinese_source": "发现敌人的部队，是我军的侦察部队。", "english_target_correct": "The troops who found enemy's were found to be the reconnaissance units of our army.", "english_target_wrong": "When we found the enemy's troops, they were found to be the reconnaissance units of our army."}
{"chinese_source": "遇到朋友的老师，和朋友打了个招呼。", "english_target_correct": "The teacher who met friend said hello to his friend.", "english_target_wrong": "Meet a friend's teacher and say hello to a friend."}
{"chinese_source": "遇到朋友的老师，我和老师打了个招呼。", "english_target_correct": "When I met a friend's teacher, I said hello to the teacher.", "english_target_wrong": "The teacher met his friend and I said hello to the teacher."}
{"chinese_source": "拜访邻居的父母，同时带了许多礼物。", "english_target_correct": "Visiting the neighbor's parents and bringing a lot of gifts.", "english_target_wrong": "My parents who visited the neighbors also brought a lot of gifts."}
{"chinese_source": "拜访邻居的父母，感谢了邻居这些天对我的照护。", "english_target_correct": "My parents who visited the neighbors thanked the neighbors for the neighbors' care for me these days.", "english_target_wrong": "Visiting the neighbor's parents and thanking the neighbors for the neighbors' care for me these days."}
{"chinese_source": "研究春秋的书籍，保存在图书馆里。", "english_target_correct": "The books studying the Spring and Autumn are stored in the library.", "english_target_wrong": "Study the Spring and Autumn (modern) books are stored in the library."}
{"chinese_source": "研究春秋的书籍，对理解那段历史很有帮助。", "english_target_correct": "Studying the books of the Spring and Autumn Period is very helpful in understanding that history.", "english_target_wrong": "The books  studying the Spring and Autumn are very helpful in understanding that history."}
{"chinese_source": "侮辱别人的父母，不是孩子的好榜样。", "english_target_correct": "Parents who insult other people's parents are not good examples for children.", "english_target_wrong": "Insulting other people's parents is not a good example for children."}
{"chinese_source": "侮辱别人的父母，不是一个礼貌的行为。", "english_target_correct": "It is not a polite behavior to insult someone else's parents.", "english_target_wrong": "Parents who insult other people's parents is not polite behavior."}
{"chinese_source": "观察园林的游客，讨论着园林设计。", "english_target_correct": "Visitors who observe garden are discussing garden design.", "english_target_wrong": "Observing garden visitors and discussing garden design."}
{"chinese_source": "观察园林的游客，游客的脚步都很匆忙。", "english_target_correct": "Observing garden visitors, the visitors are rushing in the footsteps of the visitors.", "english_target_wrong": "Visitors who observe garden, visitors are rushing in the footsteps of the visitors."}
{"chinese_source": "杀死了邻居的小孩儿，才仅仅十几岁。", "english_target_correct": "The kid who killed neighbor was only a teenager.", "english_target_wrong": "It was only a teenager when I killed the children of my neighbors."}
{"chinese_source": "杀死了邻居的小孩儿，凶手逃走了。", "english_target_correct": "After killing the neighbor's child, the murderer escaped.", "english_target_wrong": "The kid killed neighbor and the murderer escaped."}
{"chinese_source": "五个学校的校长聚在一起。", "english_target_correct": "The principals of the five schools got together.", "english_target_wrong": "Five principals of the school got together."}
{"chinese_source": "五个学校的老师和他们的校长，王校长站在一起。", "english_target_correct": "Five teachers of the school and their principal, President Wang stood together.", "english_target_wrong": "The teachers of the five schools and their principal, President Wang stood together."}
{"chinese_source": "两个乐队的鼓手在争吵，谁是乐队里的第一鼓手。", "english_target_correct": "Two drummers of the band are arguing, who is the first drummer in the band.", "english_target_wrong": "The drummers of the two bands are arguing, who is the first drummer in the band."}
{"chinese_source": "两个乐队的鼓手在争吵，谁是第一乐队。", "english_target_correct": "The drummers of the two bands are arguing, which is the first band.", "english_target_wrong": "Two drummers of the the band are arguing, who is the first band."}
{"chinese_source": "两个小区的住户在讨论，谁的小区房价又涨了。", "english_target_correct": "The residents of the two communities are discussing about whose residential areas where housing prices have risen again.", "english_target_wrong": "Two residents of the community are discussing about whose residential areas where housing prices have risen again."}
{"chinese_source": "两个小区的住户在讨论，他们小区的附属医院水平如何。", "english_target_correct": "Two residents of the community are discussing how the level of affiliated hospitals in their community is.", "english_target_wrong": "The residents of the two communities are discussing how the level of affiliated hospitals in their community is."}
{"chinese_source": "三个工厂里的员工出去吃饭，讨论一起去找老板加工资。", "english_target_correct": "Three employees in the factory dined out,  discussing about asking the boss to increase the pay together.", "english_target_wrong": "The employees in the three factories dined out,  discussing about asking the boss to increase the pay together."}
{"chinese_source": "三个工厂里的员工出去吃饭，讨论各自工厂的待遇（较高）。", "english_target_correct": "The employees in the three factories dined out, discussing about  the salary of their respective factories (higher).", "english_target_wrong": "Three employees in the factory dined out, discussing about  the salary of their respective factories (higher).."}
{"chinese_source": "这边有两个明星的粉丝，在讨论今晚周杰伦的演唱会。", "english_target_correct": "There are two star fans here, discussing Jay Chou's concert tonight.", "english_target_wrong": "There are fans of two stars here, discussing Jay Chou's concert tonight."}
{"chinese_source": "这边有两个明星的粉丝，在争论周杰伦和蔡徐坤谁的作品更好。", "english_target_correct": "There are fans of two stars here, arguing whose  wok is better, Jay Chou's or Cai Xukun's.", "english_target_wrong": "There are two star fans here,  arguing whose  wok is better, Jay Chou's or Cai Xukun's.."}
{"chinese_source": "五个学院的领导在商议，举办五个学院的联谊。", "english_target_correct": "The leaders of the five colleges are negotiating and organizing the communication activity of five colleges.", "english_target_wrong": "Five leaders of the college are negotiating and organizing the communication activity of five colleges."}
{"chinese_source": "五个学院的领导在商议，如何成为学校的第一学院。", "english_target_correct": "Five leaders of the college are negotiating how to become the first college of the school.", "english_target_wrong": "The leaders of the five colleges are negotiating how to become the first college of the school."}
{"chinese_source": "窗台上是两个朋友送的花瓶，两位都是我的好朋友。", "english_target_correct": "On the window sill is a vase sent by two friends, both of whom are my good friends.", "english_target_wrong": "On the window sill are two vases sent by my friend, both of whom are my good friends."}
{"chinese_source": "窗台上是两个朋友送的花瓶，两个花瓶都很好看。", "english_target_correct": "On the window sill are two vases sent by my friend, and both vases are very nice.", "english_target_wrong": "On the window sill is a vase sent by two friends, and both vases are very nice."}
{"chinese_source": "中国文化博览中心囊括了上百个国家的各色文化。", "english_target_correct": "The Culture Expo Center in China encompasses a diverse culture of hundreds of countries.", "english_target_wrong": "The Expo Center about chinese culture encompasses a diverse culture of hundreds of countries."}
{"chinese_source": "中国文化博览中心展示了中国千年的文化发展历程。", "english_target_correct": "The Expo Center about chinese culture shows the cultural development of China's millennium.", "english_target_wrong": "The Culture Expo Center in China shows the cultural development of China's millennium."}
{"chinese_source": "小学语文老师是指小学的语文老师。", "english_target_correct": "The Chinese language teacher in primary school refers to the Chinese teacher of the primary school.", "english_target_wrong": "The primary school Chinese language teacher refers to the language teacher of the primary school."}
{"chinese_source": "小学语文老师是指教授小学语文的老师。", "english_target_correct": "The Primary school Chinese language teachers refer to teachers who teach  Chinese in the primary school.", "english_target_wrong": "Primary school Chinese language teachers refer to teachers who teach language in the primary school "}
{"chinese_source": "台湾汉字研究所坐落于台北，致力于研究汉字。", "english_target_correct": "The Institute of Chinese Character in Taiwan is located in Taipei and is dedicated to the study of Chinese characters.", "english_target_wrong": "The Institute of Taiwan's Chinese Character is located in Taipei and is dedicated to the study of Chinese characters."}
{"chinese_source": "台湾汉字研究所致力于促进中国大陆研究台湾的汉字发展。", "english_target_correct": "The Institute of Taiwan's Chinese Character is committed to promoting the development of Taiwan's Chinese characters in mainland China.", "english_target_wrong": "The Institute of Chinese Character in Taiwan is committed to promoting the development of Taiwan's Chinese characters in mainland China."}
{"chinese_source": "苏州汽车展览会展示了苏州自主研发的汽车品牌。", "english_target_correct": "The exhibition of Suzhou cars showcased the auto brand independently developed by Suzhou.", "english_target_wrong": "The car exhibition in Suzhou showcased the auto brand independently developed by Suzhou."}
{"chinese_source": "苏州汽车展览会展示了世界各地的汽车品牌。", "english_target_correct": "The car exhibition in Suzhou showcases car brands around the world.", "english_target_wrong": "The exhibition of Suzhou cars showcases car brands around the world."}
{"chinese_source": "一个季度就生产了这么多设备，太棒了。", "english_target_correct": "It’s great to produce so many devices in a quarter.", "english_target_wrong": "It’s great to produce such a few devices in a quarter."}
{"chinese_source": "一个季度就生产了这么多设备，太差劲了。", "english_target_correct": "It’s too bad to produce such a few devices in a quarter.", "english_target_wrong": "It’s too bad to produce so many devices in a quarter."}
{"chinese_source": "修车的人急坏了，因为他还要开车出门。", "english_target_correct": "The person who needed to repair the car was in a hurry because he had to drive out.", "english_target_wrong": "The person who repaired the car was in a hurry because he had to drive out."}
{"chinese_source": "修车的人急坏了，因为顾客一直在催他。", "english_target_correct": "The person who repaired the car was in a hurry because the customer had been urging him.", "english_target_wrong": "The person who needed to repair the car was in a hurry because the customer had been urging him."}
{"chinese_source": "我谁也看不上，因为我没钱。", "english_target_correct": "Nobody thinks highly of me because I don't have money.", "english_target_wrong": "I have no respect for anyone because I don't have money."}
{"chinese_source": "我谁也看不上，因为我很强。", "english_target_correct": "I have no respect for anyone because I am strong.", "english_target_wrong": "Nobody thinks highly of me because I am strong."}
{"chinese_source": "王老师已经通知了，王老师马上就来。", "english_target_correct": "Teacher Wang has already been informed and he will come soon.", "english_target_wrong": "Teacher Wang has already informed that Teacher Wang will come soon."}
{"chinese_source": "王老师已经通知了，同学们都知道了。", "english_target_correct": "Teacher Wang has already notified, and the students knew it.", "english_target_wrong": "Teacher Wang has already been notified, and the students knew it."}
{"chinese_source": "部分损毁的仪器是全部损毁仪器的一半。", "english_target_correct": "Partially damaged instruments are half of all damaged instruments.", "english_target_wrong": "Part of the damaged instruments are half of all damaged instruments."}
{"chinese_source": "部分损毁的仪器损损毁得十分彻底，无法维修了。", "english_target_correct": "Part of the damaged instruments was completely destroyed and could not be repaired.", "english_target_wrong": "Partially damaged instrument was completely destroyed and could not be repaired."}
{"chinese_source": "翻译小说不是个好差事。", "english_target_correct": "Translating novels is not a good errand.", "english_target_wrong": "Transled novel is not a good errand."}
{"chinese_source": "翻译小说有时候会不如原版，不是个好差事。", "english_target_correct": "Translated novels are sometimes not as good as the original, so translatiion is not a good errand.", "english_target_wrong": "Translating novels is sometimes not as good as the original, so  translatiion is not a good errand."}
{"chinese_source": "进口奶粉有时候不一定就比国产奶粉好。", "english_target_correct": "Imported milk powder is sometimes not necessarily better than domestic milk powder.", "english_target_wrong": "Importing milk powder is sometimes not necessarily better than domestic milk powder."}
{"chinese_source": "进口奶粉需要获得国家审批的公司才能进行。", "english_target_correct": "Importing milk powder needs to be carried out by company which is approved by the state.", "english_target_wrong": "Imported milk powder needs to be approved by the state for the company to carry out."}
{"chinese_source": "这份报道我写不好，因为我的身份比较敏感。", "english_target_correct": "I am not suitable to write this report because my identity is sensitive.", "english_target_wrong": "I can't write this report well because my identity is sensitive."}
{"chinese_source": "这份报道我写不好，我知道你写得好。", "english_target_correct": "I can't write this report well, I know that you write well.", "english_target_wrong": "I am not suitable to write this report well, I know that you write well."}
{"chinese_source": "教师节老师希望学生别送礼品送祝福，心意比物品更重要。", "english_target_correct": "On teachers' Day, teachers hope that students don't send gifts but blessings because their minds are more important than items.", "english_target_wrong": "Teachers' Day teachers hope that students don't send gifts and blessings because their minds are more important than items."}
{"chinese_source": "教师节老师希望学生别送礼品送祝福，什么都不需要。", "english_target_correct": "On teacher's Day , teacher hopes that students don't send gifts but blessings because nothing is needed.", "english_target_wrong": "Teacher's Day teacher hopes that students don't send gifts but to send blessings because nothing is needed."}
{"chinese_source": "来的是哥哥和弟弟的朋友，兄弟二人有着相同的交际圈。", "english_target_correct": "Here comes the elder brother's and the little brother's friend, and the two brothers have the same social circle.", "english_target_wrong": "Here comes elder brother and the little brother's friend, and the two brothers have the same social circle."}
{"chinese_source": "来的是哥哥和弟弟的朋友，哥哥不认识弟弟的朋友。", "english_target_correct": "Here comes elder brother and the little brother's friend, and the big brother doesn’t know the little brother’s friend.", "english_target_wrong": "Here comes the elder brother's and the little brother's friend, and the elder brother doesn’t know the little brother’s friend."}
{"chinese_source": "关于鲁迅的文章，我只知道孔乙己。", "english_target_correct": "Regarding Lu Xun's article, I only know Kong Yiji.", "english_target_wrong": "Regarding articles about Lu Xun, I only know Kong Yiji."}
{"chinese_source": "关于鲁迅的文章，许多人都写过。", "english_target_correct": "Many people have written articles about Lu Xun.", "english_target_wrong": "Many people have written about Lu Xun's article."}
{"chinese_source": "对于老师的意见，老师都已经收到了。", "english_target_correct": "The teacher has already received the opinions to teachers.", "english_target_wrong": "The teacher has already received the teacher’s opinion."}
{"chinese_source": "对于老师的意见，同学们都虚心接受了。", "english_target_correct": "For the teacher's opinion, the students were humbly accepted.", "english_target_wrong": "For the opinions to teachers, the students were humbly accepted."}
{"chinese_source": "喜欢干净的小孩很多。", "english_target_correct": "There are many children who like clean.", "english_target_wrong": "I like a lot of clean children."}
{"chinese_source": "喜欢干净的小孩的人很多。", "english_target_correct": "There are many people who like clean children.", "english_target_wrong": "There are many children who like clean."}
{"chinese_source": "小李说故事很有趣，大家都爱听小李讲。", "english_target_correct": "Xiao Li is good at telling stories and everyone loves to hear the stories  Xiao Li tell .", "english_target_wrong": "Xiao Li said that the story is very interesting,  and everyone  loves to hear the stories  Xiao Li tell ."}
{"chinese_source": "小李说故事很有趣，小李建议大家都去听。", "english_target_correct": "Xiao Li said that the story is very interesting, and Xiao Li suggested that everyone listen.", "english_target_wrong": "Xiao Li is good at telling stories, and Xiao Li suggests that everyone listen."}
{"chinese_source": "他忽然想起来，他还没吃饭。", "english_target_correct": "He suddenly remembered that he had not had dinner yet.", "english_target_wrong": "He suddenly got up and he had not had dinner yet."}
{"chinese_source": "他忽然想起来，去吃饭。", "english_target_correct": "He suddenly got up and went to have dinner.", "english_target_wrong": "He suddenly remembered and went to have dinner."}
{"chinese_source": "他想不到，这题居然如此简单。", "english_target_correct": "He have nerver thought the problem was so simple.", "english_target_wrong": "He couldn't imagine thought the problem was so simple."}
{"chinese_source": "他想不到，这题的解法究竟是什么。", "english_target_correct": "He couldn't imagine what the solution to this question was.", "english_target_wrong": "He have nerver thought what the solution to this question was."}
{"chinese_source": "他这人好说话，大家都觉得跟他很好相处。", "english_target_correct": "He is a good person to talk to, everyone feels very good to get alone with him.", "english_target_wrong": "He is a good person who likes talking, everyone feels very good to get alone with him."}
{"chinese_source": "他这人好说话，一说起来就滔滔不绝。", "english_target_correct": "He is a good person who likes talking, and he can’t stop talking.", "english_target_wrong": "He is a good person to talk to, and he can’t stop talking."}
{"chinese_source": "他还欠款1000元，总算是还完欠款了。", "english_target_correct": "He paid back 1,000 yuan, and finally paid off.", "english_target_wrong": "He still owed 1,000 yuan, and finally paid off."}
{"chinese_source": "他还欠款1000元，他打算明年再还这1000元。", "english_target_correct": "He still owes 1,000 yuan, and he plans to pay it back next year.", "english_target_wrong": "He pay back 1,000 yuan, and he plans to pay it back  next year."}
{"chinese_source": "在这个银行工作的女职工和一个男人正在争吵，这个男人声称自己是一家公司的老板。", "english_target_correct": "The female worker working at the bank and a man are arguing and the man claims to be the boss of a company.", "english_target_wrong": "The female worker and a man working at the bank are arguing and the man claims to be the boss of a company."}
{"chinese_source": "在这个银行工作的女职工和一个男人正在争吵，因为这个男人在银行办事插队了。", "english_target_correct": "The female worker working in this bank and a man are arguing because the man jump the queue when he deal with things at the bank.", "english_target_wrong": "The female worker and a man working in this bank are arguing because the man jump the queue when he deal with things at the bank."}
{"chinese_source": "正在追赶的是暴徒，这些暴徒看到了一个落单的警察。", "english_target_correct": "The mobs are catching up, and the mobs saw a  policeman who was alone.", "english_target_wrong": "What they are chasing after is the mobs,and the mobs saw a policeman who was alone."}
{"chinese_source": "正在追赶的是暴徒，这个暴徒碰到了一堆警察。", "english_target_correct": "What they are chasing after is a mob, and the mob has encountered a bunch of policemen.", "english_target_wrong": "The mob is catching up,the mob has encountered a bunch of policemen."}
{"chinese_source": "正在治病的是一个医生，这个医生正在履行他的职责。", "english_target_correct": "A doctor is treating who is performing his duties.", "english_target_wrong": "What is being treated is a doctor who is performing his duties."}
{"chinese_source": "正在治病的是一个医生，这个医生已经因病离职了。", "english_target_correct": "What is being treated is a doctor who has left work because of illness.", "english_target_wrong": "A doctor is treating who has left work because of illness."}
{"chinese_source": "搜寻的是警察，警察接到群众举报有凶犯在这附近。", "english_target_correct": "The police is searching, and the police received reports from the masses that there were murderers nearby.", "english_target_wrong": "What is searched is the police, and the police received reports from the masses that there were murderers nearby."}
{"chinese_source": "搜寻的是警察，这个警察在追赶犯人的过程中失踪了。", "english_target_correct": "What is searched is a police, and the police disappeared in the process of chasing the prisoners.", "english_target_wrong": "The police is searching, and the police disappeared in the process of chasing the prisoners."}
{"chinese_source": "考查的是老师，这个老师想要知道班级里学生的成绩水平。", "english_target_correct": "What is examining is a teacher,and this teacher wants to know the level of garde of the students in the class.", "english_target_wrong": "The teacher is examined. This teacher wants to know the level of garde of the students in the class."}
{"chinese_source": "考查的是老师，老师们正在参加教师资格考试。", "english_target_correct": "The teachers are being examined and the teachers are taking the teacher qualification exam.", "english_target_wrong": "What are examining is teachers and the teachers are taking the teacher qualification exam."}
{"chinese_source": "帮助的是流浪汉，这个流浪汉冲进了火场救了不少人。", "english_target_correct": "It was the tramp who gave help and this tramp rushed into the fire and saved many people.", "english_target_wrong": "It was a tramp who received help, and this tramp rushed into the fire and saved many people."}
{"chinese_source": "帮助的是流浪汉，这个流浪汉已经很多天没吃东西了。", "english_target_correct": "It was a tramp who received helped, and this tramp has not eaten for many days.", "english_target_wrong": "The tramp is helping, this tramp has not eaten for many days."}
{"chinese_source": "检举的是官员，因为这个官员想要减轻自己的罪责。", "english_target_correct": "The official is reporting because the official wanted to reduce his guilt.", "english_target_wrong": "It was a offical who was reported because the official wanted to reduce his guilt."}
{"chinese_source": "检举的是官员，群众对于这个官员的腐败早就不满意了。", "english_target_correct": "It was a offical who is reported, and the masses were not satisfied with the corruption of this official.", "english_target_wrong": "The official is reporting, and the masses were not satisfied with the corruption of this official."}
{"chinese_source": "教育的是父母，因为这对父母认为小孩子的教育不能全依赖学校。", "english_target_correct": "It is the parents who are educating because the parents believe that the education of children cannot rely entirely on schools.", "english_target_wrong": "Parents are educated because the parents believe that the education of children cannot rely entirely on schools."}
{"chinese_source": "教育的是父母，因为这对父母经常放纵小孩做坏事。", "english_target_correct": "Parents are educated because they often indulge their children to do bad things.", "english_target_wrong": "It is the parents who are educating because they often indulge their children to do bad things."}
{"chinese_source": "欺骗的是小孩，因为这个母亲实在是没有钱给小孩买玩具。", "english_target_correct": "What is deceived is a child because the mother really has no money to buy toys for the child.", "english_target_wrong": "It is the child who deceives because the mother really has no money to buy toys for the child."}
{"chinese_source": "欺骗的是小孩，因为这个母亲对小孩很顺从。", "english_target_correct": "It is the child who deceives because the mother is very obedient to the child.", "english_target_wrong": "What is deceived is a child because the mother is very obedient to the child."}
{"chinese_source": "赞赏的是导演，这个导演的电影很好。", "english_target_correct": "What is appreciated is the director, because this director's movie is very good.", "english_target_wrong": "It is the director who appreciates,  because this director's movie is very good."}
{"chinese_source": "赞赏的是导演，这个导演对演员们的表现很满意。", "english_target_correct": "It is the director who appreciates, this director is very satisfied with the performance of the actors.", "english_target_wrong": "What is appreciated is the director, this director is very satisfied with the performance of the actors."}
{"chinese_source": "批评工厂的工人，因为这些工人已经很久没领到工资了。", "english_target_correct": "The workers who are criticizing the factory because they have not received their wages for a long time.", "english_target_wrong": "Criticize the workers in the factory because they have not received their wages for a long time."}
{"chinese_source": "批评工厂的工人，因为这些工人经常偷懒。", "english_target_correct": "Criticize the workers in the factory because these workers are often lazy.", "english_target_wrong": "The workers who are criticizing the factory because these workers are often lazy."}
{"chinese_source": "检查乡镇政府的官员，这个乡镇政府被举报说有腐败现象。", "english_target_correct": "Inspect the officials of the township government, the township government was reported to have corruption.", "english_target_wrong": "It is a offical who will inspect the township government, the township government was reported to have corruption."}
{"chinese_source": "检查巷镇政府的官员，这个乡镇政府对上级的到来表示欢迎。", "english_target_correct": "It is a offical who will inspect the township government, the township government welcomed the arrival of the superiors.", "english_target_wrong": "Inspect the officials of the township government, the township government welcomed the arrival of the superiors."}
{"chinese_source": "吓唬的是小孩子，因为今天是万圣节。", "english_target_correct": "The child is scaring others because today is Halloween.", "english_target_wrong": "It is child who is scared because today is Halloween."}
{"chinese_source": "吓唬的是小孩子，因为这小孩经常哭。", "english_target_correct": "It is a child who is scared because the child often cries.", "english_target_wrong": "The child is scaring others because the child often cries."}
{"chinese_source": "恭喜的是同事，这个同事刚被评选为杰出人才。", "english_target_correct": "It is my colleague who is congratulated, the colleague has just been selected as an outstanding talent.", "english_target_wrong": "It was my colleagues who are congratulating others, this colleague has just been selected as an outstanding talent."}
{"chinese_source": "恭喜的是同事，这个同事为他的新婚感到高兴。", "english_target_correct": "It is my colleagues who are congratulating him, this colleague is happy for his new marriage.", "english_target_wrong": "It was my colleague who is congratulated, this colleague is happy for his new marriage."}
{"chinese_source": "迎接的是一位领导，这位领导想要给来访的大企业的老板一个好印象。", "english_target_correct": "It is a leader who greets him because the leader wanted to give a good impression to the boss of the visiting big business.", "english_target_wrong": "Who was greeted is a leader because the leader wanted to give a good impression to the boss of the visiting big business."}
{"chinese_source": "迎接的是一位领导，这位领导是来视察当地工作的。", "english_target_correct": "Who was greeted is a leader,the leader came to inspect the local work.", "english_target_wrong": "It is a leader who greets him, the leader came to inspect the local work."}
{"chinese_source": "两条河里的鱼如果产生了地理隔离会有不同的进化方向。", "english_target_correct": "Fish in the two rivers will have different evolutionary directions if they are geographically isolated.", "english_target_wrong": "Two fishes in the river will have different evolutionary directions if they are geographically isolated."}
{"chinese_source": "两条河里的鱼被一个渔夫同时捞了上来。", "english_target_correct": "Two fishes in the river were fished up by a fisherman at the same time.", "english_target_wrong": "The fish in the two rivers were fished up by a fisherman at the same time."}
{"chinese_source": "五个教育机构的高层在开会，他们想要共享机构的学员信息。", "english_target_correct": "The top levels of the five educational institutions are in a meeting, and they want to share information about the students in the organization.", "english_target_wrong": "Five top levels of the educational institution are in a meeting, and they want to share information about the students in the organization."}
{"chinese_source": "五个教育机构的高层在开会，他们在商讨今年机构的经营情况。", "english_target_correct": "Five top levels of the educational institution are in a meeting and they are discussing the operation of the organization this year.", "english_target_wrong": "The top levels of the five educational institutions are in a meeting and they are discussing the operation of the organization this year."}
{"chinese_source": "这四个城市的婴儿刚刚在同一个医院出生。", "english_target_correct": "The four urban babies  were just born in the same hospital.", "english_target_wrong": "The babies in these four cities were just born in the same hospital."}
{"chinese_source": "这四个城市的婴儿所在地的文化习俗背景是不一样的。", "english_target_correct": "The cultural backgrounds of these four cities where the babies were sited are different.", "english_target_wrong": "The cultural backgrounds of the four babies in the city are different."}
{"chinese_source": "六个学院的教授在教授计算机不同方向的内容。", "english_target_correct": "Six professors from the college are teaching content in different computer's directions.", "english_target_wrong": "Professors from six colleges are teaching content in different computer's directions."}
{"chinese_source": "六个学院的教授在教授不同专业的内容。", "english_target_correct": "Professors from six colleges are teaching content that belongs to different professions.", "english_target_wrong": "Six professors from the college are teaching content that belongs to different professions."}
{"chinese_source": "三个超市的普通收银员有着不同的工资。", "english_target_correct": "The typical cashiers of the three supermarkets have different wages.", "english_target_wrong": "The three ordinary cashiers of the supermarket have different wages."}
{"chinese_source": "三个超市的普通收银员的工号是连续的。", "english_target_correct": "The job number of the three typical cashiers of the supermarket is continuous.", "english_target_wrong": "The job number of the ordinary cashiers of the three supermarkets is continuous."}
{"chinese_source": "呼喊的是明星，这个明星获得了最佳演员奖。", "english_target_correct": "It is the star who was shouting, and the star won the best actor award.", "english_target_wrong": "What was shouted is the name of the star, and the star won the best actor award."}
{"chinese_source": "呼喊的是明星，这个粉丝在机场看到了这个秘密的明星。", "english_target_correct": "What was shouted is the name of the star, for this fan saw the mysterious star at the airport.", "english_target_wrong": "It is the star who was shouting, abd this fan saw the mysterious star at the airport."}
{"chinese_source": "抵制议会的议员，因为这个议员感觉自己遭受了不公的对待。", "english_target_correct": "The parliamentarian resist the parliament because this member feels that he has been treated unfairly.", "english_target_wrong": "What is resisted is the parliament's parliamentarian because this member feels that he has been treated unfairly."}
{"chinese_source": "抵制议会的议员，因为这个议员发表了不正确的言论。", "english_target_correct": "What is resisted is the parliament's parliamentarian because this member made an incorrect statement.", "english_target_wrong": "The parliamentarian resist the parliament because this member made an incorrect statement."}
{"chinese_source": "喜欢的是他的妹妹，但他的妹妹对谁都不喜欢。", "english_target_correct": "It is his sister who is liked by someone, but his sister doesn't like anyone.", "english_target_wrong": "It is his sister who likes him, but his sister doesn't like anyone."}
{"chinese_source": "喜欢的是他的妹妹，他的妹妹一直追求着一个不喜欢她的他。", "english_target_correct": "It is his sister who likes him, his sister has been pursuing him who doesn't like her.", "english_target_wrong": "It is his sister who is liked by him, his sister has been pursuing him who doesn't like her."}
{"chinese_source": "学生家长被要求去开只允许家长在场的家长会。", "english_target_correct": "The parents of the students were asked to open a parent meeting where only parents were allowed to be present.", "english_target_wrong": "Students and parents were asked to open a parent meeting where only parents were allowed to be present."}
{"chinese_source": "学生家长在学校的安排下在聊对彼此的看法。", "english_target_correct": "The students and parents are talking about their views on each other under the arrangement of the school.", "english_target_wrong": "Parents of the students are talking about their views on each other under the arrangement of the school."}
{"chinese_source": "电视遥控器需要更换新的电池。", "english_target_correct": "The remote control of the TV needs to be replaced with  new battery.", "english_target_wrong": "The TV and the remote control needs to be replaced with  new battery."}
{"chinese_source": "电视遥控器要求是同一个品牌的。", "english_target_correct": "The TV and the remote control shall be of the same brand.", "english_target_wrong": "The remote control of the TV shall be of the same brand."}
{"chinese_source": "审判的是王将军，他犯了叛国罪。", "english_target_correct": "General Wang was brought to trial because he had committed treason.", "english_target_wrong": "The trial was conducted by General Wang, who had committed treason."}
{"chinese_source": "审判的是王将军，他判处罪犯入狱10年。", "english_target_correct": "The trial was conducted by General Wang, who sentenced the criminal to 10 years in prison.", "english_target_wrong": "General Wang was brought to trial because he sentenced the criminal to 10 years in prison."}
{"chinese_source": "教导的是小李，他手把手教会我们这门手艺。", "english_target_correct": "Li was teaching us and he taught us this craft hand by hand.", "english_target_wrong": "I taught Li and he taught us this craft."}
{"chinese_source": "教导的是小李，我教他学会了这门技术。", "english_target_correct": "I taught Li and taught him the technique hand by hand.", "english_target_wrong": "Li was teaching us and I taught him the technique."}
{"chinese_source": "喜欢的是这篇文章，写得太好了。", "english_target_correct": "Like this article because it's too well written.", "english_target_wrong": "It is this article that like because it's too well written."}
{"chinese_source": "喜欢的是学生，学生都喜欢新鲜事物。", "english_target_correct": "It is students that like because students like new things.", "english_target_wrong": "Like students because students like new things."}
{"chinese_source": "怀疑的是小李，他对任何新鲜事物都抱有怀疑态度。", "english_target_correct": "Xiao Li suspect it because he is skeptical of anything new.", "english_target_wrong": "The suspect is Xiao Li, who is skeptical of anything new."}
{"chinese_source": "怀疑的是小李，因为小李最近行为很异常。", "english_target_correct": "The suspect is Xiao Li, because Xiao Li has behaved abnormally recently.", "english_target_wrong": "Xiao Li suspect it because Xiao Li has behaved abnormally recently."}
{"chinese_source": "支持的是王议员，他十分支持这个议案。", "english_target_correct": "It got support from Mr Wang, and he supports this motion very much.", "english_target_wrong": "Mr Wang is supported and he supports this motion very much."}
{"chinese_source": "支持的是王议员，市民都为他投票。", "english_target_correct": "Mr Wang was supported and the citizens voted for him.", "english_target_wrong": "It got support from Mr Wang, and the citizens voted for him."}
{"chinese_source": "反感的是李老师，同学都不喜欢他。", "english_target_correct": "Mr. Li is disgusting, and students disliked him.", "english_target_wrong": "Mr. Li is disgusting and students didn't like him."}
{"chinese_source": "反感的是李老师，李老师十分讨厌这种行为。", "english_target_correct": "Ms. Li was disgusted and he hates this kind of behavior.", "english_target_wrong": "Ms. Li is disgusted and Ms. Li hates this kind of behavior."}
{"chinese_source": "出兵的是伊拉克，美国出动了大量部队。", "english_target_correct": "Troops were sent to Iraq, and the United States sent a large number of troops.", "english_target_wrong": "It was Iraq that sent troops, and the United States sent a large number of troops."}
{"chinese_source": "出兵的是伊拉克,伊拉克出动了一个师的兵力。", "english_target_correct": "The troops were sent by Iraq, which dispatched a division of troops.", "english_target_wrong": "Troops were sent to Iraq, which dispatched a division of troops."}
{"chinese_source": "连他也担心,你确实想多了。", "english_target_correct": "You even are worried about him, and you really think too much.", "english_target_wrong": "Even he was worried about it,, and you really think too much."}
{"chinese_source": "连他也担心,这件事确实很难。", "english_target_correct": "Even he was worried about it, so it was really difficult.", "english_target_wrong": "You even are worried about him, so it was really difficult."}
{"chinese_source": "连我也不相信，这件事居然是真的。", "english_target_correct": "Even I don't believe that this is actually true.", "english_target_wrong": "Don't even believe me, this is actually true."}
{"chinese_source": "连我也不相信，你还能相信谁？", "english_target_correct": "If you even don't believe me, who else can you trust?", "english_target_wrong": "If I don't even believe, who else can you trust?"}
{"chinese_source": "辱骂公司的员工，对他公司很不满。", "english_target_correct": "Employees abusing the company express dissatisfaction towards his company.", "english_target_wrong": "Abuse the employees of the company. and express dissatisfaction towards his company."}
{"chinese_source": "辱骂公司的员工，以及公司的领导。", "english_target_correct": "Abuse the employees and leaders of the company.", "english_target_wrong": "Employees abusing the company and leaderships of the company"}
{"chinese_source": "喜欢北方的小伙儿，因为北方冬天有暖气才留在这里。", "english_target_correct": "Young men who like the north stay here because the north has heating in winter.", "english_target_wrong": "I like the northern boys because the north has heating in winter."}
{"chinese_source": "喜欢北方的小伙儿，因为他们十分大方。", "english_target_correct": "I like the northern boys because they are very generous.", "english_target_wrong": "The Young men who like the north because they are very generous."}
{"chinese_source": "欺负小李的同学，就等于欺负小李。", "english_target_correct": "Bullying Xiao Li's classmates equals bullying Xiao Li.", "english_target_wrong": "The classmate who bullied Xiao Li equals bullying Xiao Li."}
{"chinese_source": "欺负小李的同学，被老师狠狠批评了。", "english_target_correct": "The classmate who bullied Xiao Li was severely criticized by the teacher.", "english_target_wrong": "Bullying Xiao Li's classmates was severely criticized by the teacher."}
{"chinese_source": "战胜叛军的部队，需要出动十万的正规军。", "english_target_correct": "To defeat the rebels, 100,000 regular troops are required.", "english_target_wrong": "The forces that defeated the rebels, 100,000 regular troops are required."}
{"chinese_source": "战胜叛军的部队，已经聚集在了一起。", "english_target_correct": "The forces that defeated the rebels had already gathered.", "english_target_wrong": "To defeat the rebels, the rebels had already gathered."}
{"chinese_source": "关爱员工的家人，是员工坚强的后盾。", "english_target_correct": "Families caring for employees are the strong backing of employees.", "english_target_wrong": "Caring for employees' families is the strong backing of employees."}
{"chinese_source": "关爱员工的家人，是对员工最好的关怀。", "english_target_correct": "Caring for employees' families is the best care for employees.", "english_target_wrong": "Families caring for employees is the best care for employees."}
{"chinese_source": "热爱学校的学生，是每个校长都该做到的。", "english_target_correct": "Loving students in the school is what every principal should do.", "english_target_wrong": "Students who love school is what every principal should do."}
{"chinese_source": "热爱学校的学生，总是会为学校的声誉着想。", "english_target_correct": "Students who love school always think about the reputation of the school.", "english_target_wrong": "Loving students in the school always think about the reputation of the school."}
{"chinese_source": "连累了小李的家人，让小李十分后悔。", "english_target_correct": "Affecting his family made Xiao Li regretful.", "english_target_wrong": "The family who affected Xiao Li made Xiao Li regretful."}
{"chinese_source": "连累了小李的家人，对小李十分抱歉。", "english_target_correct": "The family who affected Xiao Li felt very sorry for Xiao Li.", "english_target_wrong": "Affecting Xiao Li's family felt very sorry for Xiao Li."}
{"chinese_source": "牵连了领导的上级，让领导十分抱歉。", "english_target_correct": "Involving the leader's superior made the leader very sorry.", "english_target_wrong": "The leader's superiors who involved the leader made the leader very sorry."}
{"chinese_source": "牵连了领导的上级，让领导直接供出自己。", "english_target_correct": "The leader's superiors who involved the leader allowed the leader to give himself directly.", "english_target_wrong": "Involving the leader's superior allowed the leader to give himself directly."}
{"chinese_source": "得罪了大众的明星，就不再是明星了。", "english_target_correct": "The star who offended the public is no longer a star.", "english_target_wrong": "Offending the popular star is no longer a star."}
{"chinese_source": "得罪了大众的明星，会被明星的粉丝攻讦。", "english_target_correct": "Offending the popular star will be attacked by star fans.", "english_target_wrong": "The star who offended the public will be attacked by star fans."}
{"chinese_source": "围剿土匪的部队，随时都可以集结。", "english_target_correct": "The forces to surround the bandits can be assembled at any time.", "english_target_wrong": "Surrounding the bandits' forces can be assembled at any time."}
{"chinese_source": "围剿土匪的部队，是件刻不容缓的事情。", "english_target_correct": "Surrounding the bandits' forces is urgent.", "english_target_wrong": "The forces to surround the bandits is urgent."}
{"chinese_source": "思念家乡的人们，我无时无刻不想回去。", "english_target_correct": "Miss the people in my hometown and I don't want to go back all the time.", "english_target_wrong": "People who miss their hometown and I don't want to go back all the time."}
{"chinese_source": "思念家乡的人们，会回到家乡过年。", "english_target_correct": "People who miss their hometown will return to their hometown for Chinese New Year.", "english_target_wrong": "Miss the people in my hometown will return to their hometown for Chinese New Year."}
{"chinese_source": "打倒反对派的人士，欢聚在一起庆祝。", "english_target_correct": "People who brought down the opposition gathered together to celebrate.", "english_target_wrong": "Defeat the opposition gathered together to celebrate."}
{"chinese_source": "打倒反对派的人士，以及他们的帮凶。", "english_target_correct": "Defeat the opposition and their accomplices.", "english_target_wrong": "People who brought down the opposition and their accomplices."}
{"chinese_source": "发现敌人的部队，我军立刻展开了攻击。", "english_target_correct": "Upon discovering the enemy's troops, our army immediately launched an attack.", "english_target_wrong": "The troop discovering the enemy, our army immediately launched an attack."}
{"chinese_source": "发现敌人的部队，是我们的先头部队。", "english_target_correct": "The troop discovering the enemy is our vanguard.", "english_target_wrong": "Discovering the enemy's troop is our vanguard."}
{"chinese_source": "观察园林的行人，看上去都十分开心。", "english_target_correct": "The pedestrians observing the garden looked very happy.", "english_target_wrong": "Observing the pedestrians in the garden looked very happy."}
{"chinese_source": "观察园林的行人，行人的脚步都很匆忙。", "english_target_correct": "Observing the pedestrians in the garden, we can see that the pedestrians are hurried.", "english_target_wrong": "Pedestrians observing the garden, the pedestrians are hurried."}
{"chinese_source": "关心的是她母亲，她母亲亲自熬了粥来照顾她。", "english_target_correct": "Her mother was concerned about her, and her mother boiled porridge to take care of her.", "english_target_wrong": "She was concerned about her mother, and her mother boiled porridge to take care of her."}
{"chinese_source": "关心的是她母亲，她母亲已经七十多了。", "english_target_correct": "She was concerned about her mother, and her mother was already over seventy.", "english_target_wrong": "Her mother was concerned about her, and her mother was already over seventy."}
{"chinese_source": "关心企业的员工，这样的员工值得表扬。", "english_target_correct": "Employees who concerned about the conmpany were commendable.", "english_target_wrong": "Concerning about the employees of the company, emplyees were commendable."}
{"chinese_source": "关心企业的员工，要提升他们的生活住宿待遇。", "english_target_correct": "Concerning about the employees of the company should improve their condition for living and accommodation.", "english_target_wrong": "Employees who concerned about the conmpany should improve their living and accommodation treatment."}
{"chinese_source": "他写了两个小时的发言稿，意味着他要发言两个小时。", "english_target_correct": "He wrote a two-hour speech, which meant he would speak for two hours.", "english_target_wrong": "He wrote speech for 2 hours, which meant he would speak for two hours."}
{"chinese_source": "他写了两个小时的发言稿，还没有把发言稿写完。", "english_target_correct": "He wrote speech for 2 hours and hasn't finished it yet.", "english_target_wrong": "He wrote a two-hour speech and hasn't finished it yet."}
{"chinese_source": "这次书法比赛有两个协会的大师来当评委，他们各自为协会代言。", "english_target_correct": "In this calligraphy competition, the masters of two associations came to be judges, and they each spoke for the association.", "english_target_wrong": "In this calligraphy competition, two masters of the association came to be judges, and they each spoke for the association."}
{"chinese_source": "这次书法比赛有两个协会的大师来当评委，他们是书法协会的核心人物。", "english_target_correct": "There are two masters of the association to be judges in this calligraphy competition. They are the core figures of the calligraphy association.", "english_target_wrong": "There are masters of two association to be judges in this calligraphy competition. They are the core figures of the calligraphy association."}
{"chinese_source": "对他的尊敬，我们都承受不起。", "english_target_correct": "We can't afford his respect.", "english_target_wrong": "The respect for him, we can't afford."}
{"chinese_source": "对他的尊敬，源于他的高尚品格。", "english_target_correct": "The respect for him stems from his noble character.", "english_target_wrong": "For his respect from his noble character."}
{"chinese_source": "对于他的鼓励，我十分感谢。", "english_target_correct": "I am very grateful for his encouragement.", "english_target_wrong": "I am very grateful for the encouragement for him."}
{"chinese_source": "对于他的鼓励，深深地激励了他。", "english_target_correct": "The encouragement for him deeply inspired him.", "english_target_wrong": "For his encouragement, deeply inspired him."}
{"chinese_source": "关于他的疑惑，我直接解答了他。", "english_target_correct": "Regarding his doubts, I answered him directly.", "english_target_wrong": "The concerns about him, I answered him directly."}
{"chinese_source": "关于他的疑惑，在人们之间蔓延。", "english_target_correct": "The concerns about him spread among people.", "english_target_wrong": "Regarding his doubts spread among people."}
{"chinese_source": "对于他的恐惧，源于对他的不了解。", "english_target_correct": "The fear towards him stems from the unfamiliarity with him.", "english_target_wrong": "His fear  stems from the ignorance of him."}
{"chinese_source": "对于他的恐惧，老师耐心地抚慰了他。", "english_target_correct": "For his fear, the teacher comforted him patiently.", "english_target_wrong": "For the fear towards him, the teacher comforted him patiently."}
{"chinese_source": "两个城市的居民在讨论，哪个城市未来发展更好。", "english_target_correct": "Residents of the two cities are discussing which city will develop better in the future.", "english_target_wrong": "Two residents of the city are discussing which city will develop better in the future."}
{"chinese_source": "两个城市的居民在讨论，刚刚上任的王市长。", "english_target_correct": "Two residents of the city are discussing the newly appointed mayor of Wang.", "english_target_wrong": "Residents of the two cities are discussing the newly appointed mayor of Wang."}
{"chinese_source": "三个国家的领导人在开会，讨论各国的能源政策。", "english_target_correct": "Leaders from three countries are meeting to discuss their energy policies.", "english_target_wrong": "Three leaders of the country are meeting to discuss their energy policies."}
{"chinese_source": "三个国家的领导人在开会，讨论本国今年军费支出。", "english_target_correct": "Three leaders of the country are meeting to discuss military spending this year.", "english_target_wrong": "Leaders from three countries are meeting to discuss military spending this year."}
{"chinese_source": "参加比赛的是三个体校的学生，他们都想为各自的学校争光。", "english_target_correct": "Participating in the competition are students from three sports schools, all of whom want to win for their respective schools.", "english_target_wrong": "Participating in the competition are three students from the sports school, all of whom want to win for their respective schools."}
{"chinese_source": "参加比赛的是三个体校的学生，他们来自同一个班级。", "english_target_correct": "Participating in the competition were three students from the sports school who came from the same class.", "english_target_wrong": "Participating in the competition were students from three sports schools who came from the same class."}
{"chinese_source": "两个球队的队员在操场练球，为了今年球队的冠军。", "english_target_correct": "Two players from the team practiced on the playground for this year's championship.", "english_target_wrong": "The players of the two teams practiced on the playground for this year's championship."}
{"chinese_source": "两个球队的队员在操场练球，他们两个队经常一起对练。", "english_target_correct": "The players of the two teams practice on the playground. The two teams often practice together.", "english_target_wrong": "Two players from the team practice on the playground. The two teams often practice together."}
{"chinese_source": "放弃美丽的女人，往往都在追求更为重要的精神世界。", "english_target_correct": "Women who give up beauty often pursues a more important spiritual world.", "english_target_wrong": "Giving up the beautiful woman often pursues a more important spiritual world."}
{"chinese_source": "放弃美丽的女人，这个男人选择了离开。", "english_target_correct": "Giving up the beautiful woman, the man chose to leave.", "english_target_wrong": "Women who give up beauty, the man chose to leave."}
{"chinese_source": "学校领导对他的批评，专门开了一个研讨会。", "english_target_correct": "For the criticism from him, the school leaders held a special seminar.", "english_target_wrong": "For the criticism to him from the school leaders held a special seminar."}
{"chinese_source": "学校领导对他的批评，他早已预料到了。", "english_target_correct": "For the criticism to him from the school leaders, he had already anticipated.", "english_target_wrong": "For the criticism from him, the school leaders he had already anticipated."}
{"chinese_source": "我们三个人一组，可以分为两组。", "english_target_correct": "We can be divided into two three-member groups.", "english_target_wrong": "We three are in one group and can be divided into two groups."}
{"chinese_source": "我们三个人一组，因为我们正好可以互补。", "english_target_correct": "We three are in one group because we complement each other.", "english_target_wrong": "We are three-member group because we complement each other."}
{"chinese_source": "楼下开了家青年理发店，专为青年理发。", "english_target_correct": "There is  a new youth barber shop downstairs , which is specially for young people.", "english_target_wrong": "There is  a new youth barber shop downstairs , , which is specially for young people."}
{"chinese_source": "楼下开了家青年理发店，发型师全都是青年。", "english_target_correct": "There is  a new barber shop that young people opened downstairs , and all hairdressers are young.", "english_target_wrong": "There is  a new barber shop that young people opened downstairs, and all hairdressers are young."}
{"chinese_source": "县里通知15号前去报道，15号去就不行了。", "english_target_correct": "The county authorities informed that one's arrival should be reported before the 15th, but the 15th would not be included.", "english_target_wrong": "The county authorities  informed  that.one's arrival should be reported on the 15th, but the 15th would not be included."}
{"chinese_source": "县里通知15号前去报道，只有15号那天才行。", "english_target_correct": "The county authorities  informed  that.one's arrival should be reported on the 15th, and it would be only allowed  on the 15th.", "english_target_wrong": "The county authorities informed that one's arrival should be reported before the 15th, and it would be only allowed  on the 15th."}
{"chinese_source": "我看了十天的报纸，每天一份。", "english_target_correct": "I read the newspaper for ten days, with one newspaper for each day.", "english_target_wrong": "I read ten days' newspaper, with one newspaper for each day.."}
{"chinese_source": "我看了十天的报纸，一天全看完了。", "english_target_correct": "I read ten days' newspaper and finished reading all of them in one day.", "english_target_wrong": "I read the newspaper for ten days and  finished reading all of them in one day.."}
{"chinese_source": "学校里来了三个医院的医生，分别是协和医院，市立医院和省属医院。", "english_target_correct": "Doctors from three hospitals came to the school, namely Xiehe Hospital, Municipal Hospital and Provincial Hospital.", "english_target_wrong": "Three doctors from the hospital came to the school, namely Xiehe Hospital, Municipal Hospital and Provincial Hospital."}
{"chinese_source": "学校里来了三个医院的医生，都是协和医院的。", "english_target_correct": "Three doctors from the hospital came to school, all of whom came from Xiehe Hospital.", "english_target_wrong": "Doctors from three hospitals came to school, all of whom came from Xiehe Hospital."}
{"chinese_source": "他刚来学校，谁都不认识，只和同桌比较熟。", "english_target_correct": "He had just come to school, and he didn't know anyone but his deskmate.", "english_target_wrong": "He had just come to school. No one knew him and he was familiar with  his deskmate."}
{"chinese_source": "他刚来学校，谁都不认识，大家都不和他说话。", "english_target_correct": "He had just arrived at school, and no one knew him and spoke to him.", "english_target_wrong": "He had just arrived at school，and he didn't know anyone and no one spoke to him."}
{"chinese_source": "叫车快点，路上人不多，速度快点没事。", "english_target_correct": "Ask the drivers to drive faster. As there are not many people on the road, faster speed is fine.", "english_target_wrong": "Call the car quickly.As there are not many people on the road, faster speed is fine"}
{"chinese_source": "叫车快点，这边车很多，很好叫。", "english_target_correct": "Call the car quickly. There are a lot of cars here and you will find it easyto call one.", "english_target_wrong": "Ask the drivers to drive faster. There are a lot of cars here and you will find it easyto call one."}
{"chinese_source": "三个工人的合理建议，是一条很好的建议。", "english_target_correct": "The reasonable suggestion from the three workers is a good suggestion.", "english_target_wrong": "Three reasonable suggestions from the workers is a good suggestion."}
{"chinese_source": "三个工人的合理建议，被工会一一讨论通过。", "english_target_correct": "Three reasonable suggestions from the workers were discussed and approved by the union one by one.", "english_target_wrong": "The reasonable suggestion from  the three workers were discussed and approved by the union one by one."}
{"chinese_source": "经济损失加上诉讼费4000元，一共8000元。", "english_target_correct": "Economic loss and litigation fees  with each being 4,000 yuan is altogether 8,000 yuan.", "english_target_wrong": "Economic loss and litigation fees of  4,000 yuan,  which is altogther 8,000 yuan,"}
{"chinese_source": "经济损失加上诉讼费4000元，都由司机承担。", "english_target_correct": "Economic loss and litigation fees of  4,000 yuan,  shall be borne by the driver. ", "english_target_wrong": "Economic loss and litigation fees with each being 4,000 yuan,  shall be borne by the driver. "}
{"chinese_source": "把水留给晚上来的人喝，后来的人都渴了。", "english_target_correct": "Leave the water to those who arrive later  because those who come later are thirsty.", "english_target_wrong": "Leave the water to those who come in the evening to drink because those who come later are thirsty."}
{"chinese_source": "把水留给晚上来的人喝，到晚上就买不到水了。", "english_target_correct": "Leave the water to those who arrive in the evening because there is no water to buy at night.", "english_target_wrong": "Leave the water to those who come later to drink because there is no water to buy at night.."}
{"chinese_source": "我认识你那年才三十岁，我还是个孩子。", "english_target_correct": "I knew you when you were thirty, and I was a child then.", "english_target_wrong": "I knew you when I was thirty, and I was a child then."}
{"chinese_source": "我认识你那年才三十岁，你还是个孩子。", "english_target_correct": "I knew you when I was thirty, and you were a child then.", "english_target_wrong": "I knew you when you were thirty, and you were a child then."}
{"chinese_source": "妈妈看到我很高兴，问我为何如此开心。", "english_target_correct": "Mom saw that I was happy and asked why I was so happy.", "english_target_wrong": "Mom was happy to see me and asked why I was so happy."}
{"chinese_source": "妈妈看到我很高兴，因为她很久没见到我了。", "english_target_correct": "Mom was happy to see me because she hadn't seen me for a long time.", "english_target_wrong": "Mom saw that I was happy because she hadn't seen me for a long time."}
{"chinese_source": "他批评你做的不对，你听他的便是。", "english_target_correct": "He criticizes you for doing wrong, and you should just follow him.", "english_target_wrong": "It was wrong that he criticized you and you should just follow him."}
{"chinese_source": "他批评你做的不对，你又没做错什么。", "english_target_correct": "It was wrong that he criticized you because you did nothing wrong.", "english_target_wrong": "He criticizes you for doing wrong because you did nothing wrong."}
